test/fixtures/gocardless/sync/annualSubscription.json

{
  "customers": [
    {
      "id": "CU4166B967F25F",
      "created_at": "2017-02-24T11:11:23.029Z",
      "email": "7CF05B681CDC@test.com",
      "given_name": "Test",
      "family_name": "Test",
      "company_name": "",
      "address_line1": "Test",
      "address_line2": "Test",
      "address_line3": "",
      "city": "Test",
      "region": "",
      "postal_code": "BS1 1AA",
      "country_code": "GB",
      "language": "en",
      "swedish_identity_number": null,
      "danish_identity_number": null,
      "metadata": {}
    }
  ],
  "mandates": [
    {
      "id": "MDA7BB779CBF30",
      "created_at": "2017-02-24T11:11:23.102Z",
      "reference": "A637956750C3",
      "status": "active",
      "scheme": "bacs",
      "next_possible_charge_date": "2018-06-25",
      "payments_require_approval": false,
      "metadata": {},
      "links": {
        "customer_bank_account": "BA103C18E1C8BF",
        "creditor": "CRBF68C20EFA46",
        "customer": "CU4166B967F25F"
      }
    }
  ],
  "subscriptions": [
    {
      "id": "SB596D3492B44C",
      "created_at": "2017-02-24T11:11:23.189Z",
      "amount": 1200,
      "currency": "GBP",
      "status": "active",
      "name": "£12 Yearly Membership",
      "start_date": "2017-03-02",
      "end_date": null,
      "interval": 12,
      "interval_unit": "monthly",
      "day_of_month": null,
      "month": null,
      "metadata": {},
      "payment_reference": null,
      "upcoming_payments": [
        {
          "charge_date": "2019-03-03",
          "amount": 1200
        },
        {
          "charge_date": "2020-03-01",
          "amount": 1200
        },
        {
          "charge_date": "2021-03-02",
          "amount": 1200
        },
        {
          "charge_date": "2022-03-02",
          "amount": 1200
        },
        {
          "charge_date": "2023-03-02",
          "amount": 1200
        },
        {
          "charge_date": "2024-03-03",
          "amount": 1200
        },
        {
          "charge_date": "2025-03-02",
          "amount": 1200
        },
        {
          "charge_date": "2026-03-02",
          "amount": 1200
        },
        {
          "charge_date": "2027-03-02",
          "amount": 1200
        },
        {
          "charge_date": "2028-03-01",
          "amount": 1200
        }
      ],
      "app_fee": null,
      "links": {
        "mandate": "MDA7BB779CBF30"
      }
    }
  ],
  "payments": [
    {
      "id": "PM05DA69A063A0",
      "created_at": "2018-02-27T20:10:44.488Z",
      "charge_date": "2018-03-04",
      "amount": 1200,
      "description": "£12 Yearly Membership",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDA7BB779CBF30",
        "subscription": "SB596D3492B44C"
      }
    },
    {
      "id": "PMF3852DB98E77",
      "created_at": "2017-02-24T11:11:23.363Z",
      "charge_date": "2017-03-02",
      "amount": 1200,
      "description": "£12 Yearly Membership",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDA7BB779CBF30",
        "subscription": "SB596D3492B44C"
      }
    }
  ],
  "subscriptionCancelledEvents": []
}
