test/fixtures/gocardless/sync/cancelledSubscription.json

{
  "customers": [
    {
      "id": "CUE3AAD9C5F65D",
      "created_at": "2018-02-27T00:53:17.089Z",
      "email": "3097E170F2D9@test.com",
      "given_name": "Test",
      "family_name": "Test",
      "company_name": "",
      "address_line1": "Test",
      "address_line2": "Test",
      "address_line3": "",
      "city": "Test",
      "region": "",
      "postal_code": "BS1 1AA",
      "country_code": "GB",
      "language": "en",
      "swedish_identity_number": null,
      "danish_identity_number": null,
      "metadata": {}
    }
  ],
  "mandates": [
    {
      "id": "MDBBD5EE1B2783",
      "created_at": "2018-02-27T00:53:17.218Z",
      "reference": "E9C2CD31FC2B",
      "status": "cancelled",
      "scheme": "bacs",
      "next_possible_charge_date": "Invalid date",
      "payments_require_approval": false,
      "metadata": {},
      "links": {
        "customer_bank_account": "BA6A34FC2DB7B9",
        "creditor": "CRAA2E93E7284E",
        "customer": "CUE3AAD9C5F65D"
      }
    }
  ],
  "subscriptions": [
    {
      "id": "SB4E5BCAD17DA4",
      "created_at": "2018-02-27T00:53:17.544Z",
      "amount": 500,
      "currency": "GBP",
      "status": "cancelled",
      "name": "Membership: £5 monthly",
      "start_date": "2018-03-05",
      "end_date": null,
      "interval": 1,
      "interval_unit": "monthly",
      "day_of_month": null,
      "month": null,
      "metadata": {},
      "payment_reference": null,
      "upcoming_payments": [],
      "app_fee": null,
      "links": {
        "mandate": "MDBBD5EE1B2783"
      }
    }
  ],
  "payments": [
    {
      "id": "PME5C16546C25D",
      "created_at": "2018-05-31T09:13:52.907Z",
      "charge_date": "2018-06-05",
      "amount": 500,
      "description": "Membership: £5 monthly",
      "currency": "GBP",
      "status": "confirmed",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDBBD5EE1B2783",
        "subscription": "SB4E5BCAD17DA4"
      }
    },
    {
      "id": "PM74C02BDDC3CE",
      "created_at": "2018-05-01T09:29:05.147Z",
      "charge_date": "2018-05-07",
      "amount": 500,
      "description": "Membership: £5 monthly",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDBBD5EE1B2783",
        "subscription": "SB4E5BCAD17DA4"
      }
    },
    {
      "id": "PM401A147F3A85",
      "created_at": "2018-04-02T09:14:03.195Z",
      "charge_date": "2018-04-05",
      "amount": 500,
      "description": "Membership: £5 monthly",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDBBD5EE1B2783",
        "subscription": "SB4E5BCAD17DA4"
      }
    },
    {
      "id": "PM6A7FE9BE3CEF",
      "created_at": "2018-02-27T00:53:17.886Z",
      "charge_date": "2018-03-05",
      "amount": 500,
      "description": "Membership: £5 monthly",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDBBD5EE1B2783",
        "subscription": "SB4E5BCAD17DA4"
      }
    }
  ],
  "subscriptionCancelledEvents": [
    {
      "id": "EV51812C79C358",
      "created_at": "2018-06-21T11:12:54.828Z",
      "resource_type": "subscriptions",
      "action": "cancelled",
      "links": {
        "subscription": "SB4E5BCAD17DA4"
      },
      "details": {
        "origin": "bank",
        "cause": "mandate_cancelled",
        "scheme": "bacs",
        "reason_code": "ADDACS-1",
        "description": "The mandate for this subscription was cancelled at a bank branch."
      },
      "metadata": {}
    }
  ]
}
