test/fixtures/gocardless/sync/noSubscriptions.json

{
  "customers": [
    {
      "id": "CU03BB40A543EF",
      "created_at": "2014-03-25T00:07:49.407Z",
      "email": "BA1A10AE1B98@test.com",
      "given_name": "Test",
      "family_name": "Test",
      "company_name": "",
      "address_line1": "Test",
      "address_line2": "Test",
      "address_line3": "",
      "city": "Test",
      "region": "",
      "postal_code": "BS1 1AA",
      "country_code": "GB",
      "language": "en",
      "swedish_identity_number": null,
      "danish_identity_number": null,
      "metadata": {}
    }
  ],
  "mandates": [
    {
      "id": "MDF0D4116165CF",
      "created_at": "2016-02-10T17:03:29.763Z",
      "reference": "A2129FD5106E",
      "status": "active",
      "scheme": "bacs",
      "next_possible_charge_date": "2018-06-16",
      "payments_require_approval": true,
      "metadata": {},
      "links": {
        "customer_bank_account": "BA2B6FDCD10F00",
        "creditor": "CR5F75B06EE786",
        "customer": "CU03BB40A543EF"
      }
    },
    {
      "id": "MDBA516220E98F",
      "created_at": "2016-02-10T17:03:29.803Z",
      "reference": "423D13327E3F",
      "status": "active",
      "scheme": "bacs",
      "next_possible_charge_date": "2018-06-16",
      "payments_require_approval": true,
      "metadata": {},
      "links": {
        "customer_bank_account": "BA2B6FDCD10F00",
        "creditor": "CR5F75B06EE786",
        "customer": "CU03BB40A543EF"
      }
    },
    {
      "id": "MDDA853E236735",
      "created_at": "2014-03-25T00:07:49.813Z",
      "reference": "0D726ADFB0D6",
      "status": "active",
      "scheme": "bacs",
      "next_possible_charge_date": "2018-06-16",
      "payments_require_approval": true,
      "metadata": {},
      "links": {
        "customer_bank_account": "BA2B6FDCD10F00",
        "creditor": "CR5F75B06EE786",
        "customer": "CU03BB40A543EF"
      }
    }
  ],
  "subscriptions": [],
  "payments": [
    {
      "id": "PM799C8A8857D4",
      "created_at": "2014-04-08T21:30:22.639Z",
      "charge_date": "2014-04-14",
      "amount": 500,
      "description": "The Bristol Cable - A Citizen Media Co-op",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDDA853E236735"
      }
    },
    {
      "id": "PMF731919B8D20",
      "created_at": "2014-04-08T21:30:21.456Z",
      "charge_date": "2014-04-14",
      "amount": 2500,
      "description": "The Bristol Cable - A Citizen Media Co-op",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDDA853E236735"
      }
    },
    {
      "id": "PM2DD3D3CF107D",
      "created_at": "2014-04-08T21:30:22.107Z",
      "charge_date": "2014-04-14",
      "amount": 1500,
      "description": "The Bristol Cable - A Citizen Media Co-op",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDDA853E236735"
      }
    }
  ],
  "subscriptionCancelledEvents": []
}
