test/fixtures/gocardless/sync/paymentWithNoSubscription.json

{
  "customers": [
    {
      "id": "CUB31746FAFE06",
      "created_at": "2016-02-07T16:30:55.826Z",
      "email": "120183589192@test.com",
      "given_name": "Test",
      "family_name": "Test",
      "company_name": "",
      "address_line1": "Test",
      "address_line2": "Test",
      "address_line3": "",
      "city": "Test",
      "region": "",
      "postal_code": "BS1 1AA",
      "country_code": "GB",
      "language": "en",
      "swedish_identity_number": null,
      "danish_identity_number": null,
      "metadata": {}
    }
  ],
  "mandates": [
    {
      "id": "MD887D07F08AFA",
      "created_at": "2016-02-07T16:30:55.964Z",
      "reference": "9487863820F2",
      "status": "cancelled",
      "scheme": "bacs",
      "next_possible_charge_date": "Invalid date",
      "payments_require_approval": true,
      "metadata": {},
      "links": {
        "customer_bank_account": "BAE37A1C834DA6",
        "creditor": "CR26AB0ABAD131",
        "customer": "CUB31746FAFE06"
      }
    }
  ],
  "subscriptions": [
    {
      "id": "SB5FA700622D8E",
      "created_at": "2016-09-29T22:51:48.663Z",
      "amount": 3600,
      "currency": "GBP",
      "status": "customer_approval_denied",
      "name": "£36 Yearly Membership",
      "start_date": "2017-02-13",
      "end_date": null,
      "interval": 12,
      "interval_unit": "monthly",
      "day_of_month": null,
      "month": null,
      "metadata": {},
      "payment_reference": null,
      "upcoming_payments": [
        {
          "charge_date": "2019-02-13",
          "amount": 3600
        },
        {
          "charge_date": "2020-02-13",
          "amount": 3600
        },
        {
          "charge_date": "2021-02-13",
          "amount": 3600
        },
        {
          "charge_date": "2022-02-13",
          "amount": 3600
        },
        {
          "charge_date": "2023-02-15",
          "amount": 3600
        },
        {
          "charge_date": "2024-02-14",
          "amount": 3600
        },
        {
          "charge_date": "2025-02-13",
          "amount": 3600
        },
        {
          "charge_date": "2026-02-13",
          "amount": 3600
        },
        {
          "charge_date": "2027-02-13",
          "amount": 3600
        },
        {
          "charge_date": "2028-02-13",
          "amount": 3600
        }
      ],
      "app_fee": null,
      "links": {
        "mandate": "MD887D07F08AFA"
      }
    }
  ],
  "payments": [
    {
      "id": "PM81E93B96F712",
      "created_at": "2016-02-07T16:30:56.016Z",
      "charge_date": "2016-02-13",
      "amount": 3600,
      "description": "£36 Yearly Membership",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MD887D07F08AFA"
      }
    }
  ],
  "subscriptionCancelledEvents": []
}
