test/fixtures/gocardless/sync/pendingPaymentWithAmountUpdate.json

{
  "customers": [
    {
      "id": "CU885671D5F9B6",
      "created_at": "2018-06-12T18:55:47.172Z",
      "email": "85D572EBDE13@test.com",
      "given_name": "Test",
      "family_name": "Test",
      "company_name": "",
      "address_line1": "Test",
      "address_line2": "Test",
      "address_line3": "",
      "city": "Test",
      "region": "",
      "postal_code": "BS1 1AA",
      "country_code": "GB",
      "language": "en",
      "swedish_identity_number": null,
      "danish_identity_number": null,
      "metadata": {}
    }
  ],
  "mandates": [
    {
      "id": "MDA2CB845909F6",
      "created_at": "2018-06-12T18:55:47.228Z",
      "reference": "E51A59E899D9",
      "status": "active",
      "scheme": "bacs",
      "next_possible_charge_date": "2018-06-19",
      "payments_require_approval": false,
      "metadata": {},
      "links": {
        "customer_bank_account": "BAB5478A2FAE08",
        "creditor": "CRF1A620CC3DAB",
        "customer": "CU885671D5F9B6"
      }
    }
  ],
  "subscriptions": [
    {
      "id": "SB4EE7140CF2CC",
      "created_at": "2018-06-12T18:55:47.872Z",
      "amount": 1200,
      "currency": "GBP",
      "status": "active",
      "name": "Membership: £12 monthly",
      "start_date": "2018-06-18",
      "end_date": null,
      "interval": 1,
      "interval_unit": "monthly",
      "day_of_month": null,
      "month": null,
      "metadata": {},
      "payment_reference": null,
      "upcoming_payments": [
        {
          "charge_date": "2018-06-18",
          "amount": 500
        },
        {
          "charge_date": "2018-07-18",
          "amount": 1200
        },
        {
          "charge_date": "2018-08-20",
          "amount": 1200
        },
        {
          "charge_date": "2018-09-18",
          "amount": 1200
        },
        {
          "charge_date": "2018-10-18",
          "amount": 1200
        },
        {
          "charge_date": "2018-11-19",
          "amount": 1200
        },
        {
          "charge_date": "2018-12-18",
          "amount": 1200
        },
        {
          "charge_date": "2019-01-18",
          "amount": 1200
        },
        {
          "charge_date": "2019-02-18",
          "amount": 1200
        },
        {
          "charge_date": "2019-03-18",
          "amount": 1200
        }
      ],
      "app_fee": null,
      "links": {
        "mandate": "MDA2CB845909F6"
      }
    }
  ],
  "payments": [
    {
      "id": "PM3F2C37BE062C",
      "created_at": "2018-06-12T18:55:48.148Z",
      "charge_date": "2018-06-18",
      "amount": 500,
      "description": "Membership: £5 monthly",
      "currency": "GBP",
      "status": "pending_submission",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDA2CB845909F6",
        "subscription": "SB4EE7140CF2CC"
      }
    }
  ],
  "subscriptionCancelledEvents": []
}
