test/fixtures/gocardless/sync/successfulPaymentWithAmountUpdate.json

{
  "customers": [
    {
      "id": "CUB415ED158FED",
      "created_at": "2017-10-16T01:43:08.400Z",
      "email": "2C011C6107CD@test.com",
      "given_name": "Test",
      "family_name": "Test",
      "company_name": "",
      "address_line1": "Test",
      "address_line2": "Test",
      "address_line3": "",
      "city": "Test",
      "region": "",
      "postal_code": "BS1 1AA",
      "country_code": "GB",
      "language": "en",
      "swedish_identity_number": null,
      "danish_identity_number": null,
      "metadata": {}
    }
  ],
  "mandates": [
    {
      "id": "MDE8ED2B62D502",
      "created_at": "2017-10-16T01:43:08.459Z",
      "reference": "06A3D375AF48",
      "status": "active",
      "scheme": "bacs",
      "next_possible_charge_date": "2018-06-14",
      "payments_require_approval": false,
      "metadata": {},
      "links": {
        "customer_bank_account": "BAFA6BA75EA359",
        "creditor": "CR4EDA83D1C5FA",
        "customer": "CUB415ED158FED"
      }
    }
  ],
  "subscriptions": [
    {
      "id": "SBC905038A0B36",
      "created_at": "2017-10-16T01:43:35.227Z",
      "amount": 2000,
      "currency": "GBP",
      "status": "active",
      "name": "Membership: £20 annually",
      "start_date": "2017-11-22",
      "end_date": null,
      "interval": 1,
      "interval_unit": "yearly",
      "day_of_month": null,
      "month": null,
      "metadata": {},
      "payment_reference": null,
      "upcoming_payments": [
        {
          "charge_date": "2018-11-22",
          "amount": 2000
        },
        {
          "charge_date": "2019-11-22",
          "amount": 2000
        },
        {
          "charge_date": "2020-11-22",
          "amount": 2000
        },
        {
          "charge_date": "2021-11-24",
          "amount": 2000
        },
        {
          "charge_date": "2022-11-23",
          "amount": 2000
        },
        {
          "charge_date": "2023-11-22",
          "amount": 2000
        },
        {
          "charge_date": "2024-11-22",
          "amount": 2000
        },
        {
          "charge_date": "2025-11-22",
          "amount": 2000
        },
        {
          "charge_date": "2026-11-22",
          "amount": 2000
        },
        {
          "charge_date": "2027-11-24",
          "amount": 2000
        }
      ],
      "app_fee": null,
      "links": {
        "mandate": "MDE8ED2B62D502"
      }
    },
    {
      "id": "SB3FF9BBC9835E",
      "created_at": "2017-10-16T01:43:08.585Z",
      "amount": 500,
      "currency": "GBP",
      "status": "cancelled",
      "name": "Membership: £5 monthly",
      "start_date": "2017-10-21",
      "end_date": null,
      "interval": 1,
      "interval_unit": "monthly",
      "day_of_month": null,
      "month": null,
      "metadata": {},
      "payment_reference": null,
      "upcoming_payments": [],
      "app_fee": null,
      "links": {
        "mandate": "MDE8ED2B62D502"
      }
    }
  ],
  "payments": [
    {
      "id": "PM3B6568F620D6",
      "created_at": "2017-11-17T18:59:36.863Z",
      "charge_date": "2017-11-22",
      "amount": 10800,
      "description": "Membership: £108 annually",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDE8ED2B62D502",
        "subscription": "SBC905038A0B36"
      }
    },
    {
      "id": "PM6890ACE42AA2",
      "created_at": "2017-10-16T01:43:08.688Z",
      "charge_date": "2017-10-21",
      "amount": 500,
      "description": "Membership: £5 monthly",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDE8ED2B62D502",
        "subscription": "SB3FF9BBC9835E"
      }
    }
  ],
  "subscriptionCancelledEvents": [
    {
      "id": "EVCF23F086F4ED",
      "created_at": "2017-10-16T01:43:35.057Z",
      "resource_type": "subscriptions",
      "action": "cancelled",
      "links": {
        "subscription": "SB3FF9BBC9835E"
      },
      "details": {
        "origin": "api",
        "cause": "subscription_cancelled",
        "description": "The subscription has been cancelled at your request."
      },
      "metadata": {}
    }
  ]
}
